In [2]:
#importing numpy and pandas libraries
import numpy as np
import pandas as pd

#create 2 lists,a Numpy array and a dictionary
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [3]:
#importing numpy and pandas libraries
import numpy as np
import pandas as pd

#create 2 lists,a Numpy array and a dictionary
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
Series = pd.Series(my_list, index=labels)

Series[0]

#Returns 10

Series['a']

#Also returns 10

10

Used the created labels to label them a, b, and c and the used the series[] to get a certain one, this case, a or 10

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series([sum, print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

Last 2 are showing the advantages of pandas series over numpy

In [7]:
#importing numpy and pandas libraries
import numpy as np
import pandas as pd

#making rows and column with lists
rows = ['X','Y','Z']
cols = ['A', 'B', 'C', 'D', 'E']

#creating Numpy array
data = np.round(np.random.randn(3,5),2)
pd.DataFrame(data, rows, cols)

      A     B     C     D     E
X -0.82  0.13  0.04  1.30  0.27
Y  0.17 -1.12 -0.33 -0.36  1.53
Z -0.67 -0.04  0.85 -0.98 -0.05

Created a pandas DataFrame. Looks way better

In [10]:
df = pd.DataFrame(data, rows, cols)
df['A']

X   -0.82
Y    0.17
Z   -0.67
Name: A, dtype: float64

In [11]:
df['E']

X    0.27
Y    1.53
Z   -0.05
Name: E, dtype: float64

Examples of calling a specific Series

In [12]:
df['A + B'] = df['A'] + df['B']
df

      A     B     C     D     E  A + B
X -0.82  0.13  0.04  1.30  0.27  -0.69
Y  0.17 -1.12 -0.33 -0.36  1.53  -0.95
Z -0.67 -0.04  0.85 -0.98 -0.05  -0.71

Created a new column that adds a + b

In [13]:
df.drop('A + B', axis = 1)

      A     B     C     D     E
X -0.82  0.13  0.04  1.30  0.27
Y  0.17 -1.12 -0.33 -0.36  1.53
Z -0.67 -0.04  0.85 -0.98 -0.05

Drops the newly added column but doesn't delete it

In [14]:
df

      A     B     C     D     E  A + B
X -0.82  0.13  0.04  1.30  0.27  -0.69
Y  0.17 -1.12 -0.33 -0.36  1.53  -0.95
Z -0.67 -0.04  0.85 -0.98 -0.05  -0.71

see... lol

In [15]:
df = df.drop('A + B', axis=1)

In [16]:
df

      A     B     C     D     E
X -0.82  0.13  0.04  1.30  0.27
Y  0.17 -1.12 -0.33 -0.36  1.53
Z -0.67 -0.04  0.85 -0.98 -0.05

It dropped the A+B

In [17]:
df.drop('Z')

      A     B     C     D     E
X -0.82  0.13  0.04  1.30  0.27
Y  0.17 -1.12 -0.33 -0.36  1.53

In [18]:
df.loc['X']

A   -0.82
B    0.13
C    0.04
D    1.30
E    0.27
Name: X, dtype: float64

Locating a certain row, in this case, X

In [19]:
df.shape

(3, 5)

3 row, 5 columns

In [20]:
df[['A', 'B']]

      A     B
X -0.82  0.13
Y  0.17 -1.12
Z -0.67 -0.04

In [21]:
df[['A', 'B']].loc[['X', 'Y']]

      A     B
X -0.82  0.13
Y  0.17 -1.12

First I selected the row A and B and then we got just the X and Y rows from them

In [22]:
df[df > 0.5]

    A   B     C    D     E
X NaN NaN   NaN  1.3   NaN
Y NaN NaN   NaN  NaN  1.53
Z NaN NaN  0.85  NaN   NaN

seeing which integer is greater than .5 in the DateFrame

In [23]:
df.reset_index()

  index     A     B     C     D     E
0     X -0.82  0.13  0.04  1.30  0.27
1     Y  0.17 -1.12 -0.33 -0.36  1.53
2     Z -0.67 -0.04  0.85 -0.98 -0.05

Reset the DataFrame

In [25]:
df.set_index('A')

          B     C     D     E
A
-0.82  0.13  0.04  1.30  0.27
 0.17 -1.12 -0.33 -0.36  1.53
-0.67 -0.04  0.85 -0.98 -0.05

Sets A as index

In [27]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [28]:
df.columns = [1, 2, 3, 4, 5]

df

      1     2     3     4     5
X -0.82  0.13  0.04  1.30  0.27
Y  0.17 -1.12 -0.33 -0.36  1.53
Z -0.67 -0.04  0.85 -0.98 -0.05

Changed columns to 12345

In [29]:
np.nan

nan

In [30]:
df = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))
df.columns = ['A', 'B', 'C']

df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

Created new DataFrame

In [31]:
df.dropna()

     A    B    C
0  1.0  5.0  1.0

Drops any row with NaN

In [32]:
df.dropna(axis=1)

     C
0  1.0
1  2.0
2  3.0

Drops any column with a NaN

In [33]:
df.fillna('?')

     A    B    C
0  1.0  5.0  1.0
1  2.0    ?  2.0
2    ?    ?  3.0

Fills any NaN with a ?

In [34]:
df.fillna(df.mean())

     A    B    C
0  1.0  5.0  1.0
1  2.0  5.0  2.0
2  1.5  5.0  3.0

In [35]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

Fills any NaN with the mean value

In [36]:
df = pd.DataFrame([ ['Google', 'Sam', 200],

                    ['Google', 'Charlie', 120],

                    ['Salesforce','Ralph', 125],

                    ['Salesforce','Emily', 250],

                    ['Adobe','Rosalynn', 150],

                    ['Adobe','Chelsea', 500]])

df.columns = ['Organization', 'Salesperson Name', 'Sales']

df

  Organization Salesperson Name  Sales
0       Google              Sam    200
1       Google          Charlie    120
2   Salesforce            Ralph    125
3   Salesforce            Emily    250
4        Adobe         Rosalynn    150
5        Adobe          Chelsea    500

Created new DataFrame to use

In [37]:
df.groupby('Organization')

Created object Organization successfully

In [38]:
df.groupby('Organization').mean()
#The mean (or average) of the sales column

df.groupby('Organization').sum()
#The sum of the sales column

df.groupby('Organization').std()
#The standard deviation of the sales column

C:\Users\cscho\AppData\Local\Temp\ipykernel_23632\4186759256.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Organization').mean()
C:\Users\cscho\AppData\Local\Temp\ipykernel_23632\4186759256.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Organization').sum()
C:\Users\cscho\AppData\Local\Temp\ipykernel_23632\4186759256.py:7: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Organization').std()

                   Sales
Organization
Adobe         247.487373
Google         56.568542
Salesforce     88.388348

In [39]:
df.groupby('Organization').describe()

             Sales
             count   mean         std    min     25%    50%     75%    max
Organization
Adobe          2.0  325.0  247.487373  150.0  237.50  325.0  412.50  500.0
Google         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Salesforce     2.0  187.5   88.388348  125.0  156.25  187.5  218.75  250.0

Used the describe method to return info from every category in groupby

In [40]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],

                        'B': ['B0', 'B1', 'B2', 'B3'],

                        'C': ['C0', 'C1', 'C2', 'C3'],

                        'D': ['D0', 'D1', 'D2', 'D3']},

                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],

                        'B': ['B4', 'B5', 'B6', 'B7'],

                        'C': ['C4', 'C5', 'C6', 'C7'],

                        'D': ['D4', 'D5', 'D6', 'D7']},

                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],

                        'B': ['B8', 'B9', 'B10', 'B11'],

                        'C': ['C8', 'C9', 'C10', 'C11'],

                        'D': ['D8', 'D9', 'D10', 'D11']},

                        index=[8, 9, 10, 11])

In [41]:
str1 = "Hello "

str2 = "World!"

str1 + str2

'Hello World!'

In [42]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Used concat method to make 2 DataFrames next to eachother

In [43]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Big and Ugly

In [44]:
import pandas as pd

leftDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

   

rightDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']})

In [45]:
pd.merge(leftDataFrame, rightDataFrame, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Used merge to merge the 2 DataFrames

In [46]:
leftDataFrame = pd.DataFrame({  'A': ['A0', 'A1', 'A2', 'A3'],

                                'B': ['B0', 'B1', 'B2', 'B3']},

                                index =['K0', 'K1', 'K2', 'K3'])

   

rightDataFrame = pd.DataFrame({ 'C': ['C0', 'C1', 'C2', 'C3'],

                                'D': ['D0', 'D1', 'D2', 'D3']},

                                index = ['K0', 'K1', 'K2', 'K3'])

In [47]:
leftDataFrame.join(rightDataFrame)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

Used join to join the 2 DataFrames

In [48]:
df = pd.DataFrame({'col1':['A','B','C','D'],

                   'col2':[2,7,3,7],

                   'col3':['fgh','rty','asd','qwe']})

In [50]:
df['col2'].unique()

array([2, 7, 3], dtype=int64)

Ran the df.unigue() and got the error. Didn't like it on the screen so I cut it.

In [51]:
df['col2'].nunique()

3

In [52]:
df['col2'].value_counts()

7    2
2    1
3    1
Name: col2, dtype: int64

Counted nunigue to count unique values and then counted all the values

In [54]:
def exponentify(x):
    return x**x

In [55]:
df['col2'].apply(exponentify)

0         4
1    823543
2        27
3    823543
Name: col2, dtype: int64

In [56]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

Used the Apply method

In [57]:
df.sort_values('col2')

  col1  col2 col3
0    A     2  fgh
2    C     3  asd
1    B     7  rty
3    D     7  qwe

Sorted the DataFrame

In [58]:
import pandas as pd

pd.read_csv('stock_prices.csv')

,Period,Alphabet Inc Price,Amazon.com Inc Price,Facebook Inc Price,Microsoft Corp Price
0,2020-04-06 00:00:00,1167.150000,1970.70,163.000,161.590
1,2020-04-03 00:00:00,1097.880000,1906.59,154.180,153.830
2,2020-04-02 00:00:00,1120.840000,1918.83,158.190,155.260
3,2020-04-01 00:00:00,1105.620000,1907.70,159.600,152.110
4,2020-03-31 00:00:00,1162.810000,1949.72,166.800,157.710
...,...,...,...,...,...
1259,2015-04-09 00:00:00,539.299623,383.54,82.170,41.480
1260,2015-04-08 00:00:00,540.127350,381.20,82.275,41.420
1261,2015-04-07 00:00:00,535.549915,374.41,82.320,41.530
1262,2015-04-06 00:00:00,535.295614,377.04,82.440,41.545
1263,2015-04-02 00:00:00,534.063994,372.25,81.555,40.290

In [59]:
new_data_frame = pd.read_csv('stock_prices.csv')

Imported csv file, the right way this time and then assigned it to a variable

In [60]:
import pandas as pd

import numpy as np

df = pd.DataFrame(np.random.randn(50,3))

In [61]:
df.to_csv('my_new_csv.csv')

In [62]:
new_data_frame.to_csv('my_new_csv.csv', index = False)

In [63]:
pd.read_csv('stock_prices.csv')

,Period,Alphabet Inc Price,Amazon.com Inc Price,Facebook Inc Price,Microsoft Corp Price
0,2020-04-06 00:00:00,1167.150000,1970.70,163.000,161.590
1,2020-04-03 00:00:00,1097.880000,1906.59,154.180,153.830
2,2020-04-02 00:00:00,1120.840000,1918.83,158.190,155.260
3,2020-04-01 00:00:00,1105.620000,1907.70,159.600,152.110
4,2020-03-31 00:00:00,1162.810000,1949.72,166.800,157.710
...,...,...,...,...,...
1259,2015-04-09 00:00:00,539.299623,383.54,82.170,41.480
1260,2015-04-08 00:00:00,540.127350,381.20,82.275,41.420
1261,2015-04-07 00:00:00,535.549915,374.41,82.320,41.530
1262,2015-04-06 00:00:00,535.295614,377.04,82.440,41.545
1263,2015-04-02 00:00:00,534.063994,372.25,81.555,40.290

NOt sure what all this did????

In [68]:
new_data_frame.to_excel('stock_prices.xlsx', sheet_name='Sheet2')